# --------------------
# brew tap
# --------------------

# --------------------
# brew install
# --------------------

# ---- core ----
brew "git"
brew "fish"

# ---- terminal ----
brew "tmux"
tap "homebrew/cask-fonts"
cask "font-hack"

# ---- Neovim ----
brew "neovim"
brew "luajit"

# ---- utility ----
brew "wget"
brew "peco"
brew "lazygit"
brew "autojump"
brew "thefuck"
brew "fzf"
brew "rg"
brew "jq"
brew "yq"
brew "git-lfs"
brew "watch"
brew "colordiff"
brew "gh"
brew "bat"
brew "diff-so-fancy"
brew "age"
brew "openssl@3"
brew "shellcheck"
brew "coreutils"
brew "moreutils"
brew "gomplate"
brew "task"
brew "telnet"
brew "tree"

# --- dev ----
brew "ruby-build" # for rbenv
brew "node-build" # for nodenv
brew "anyenv"
brew "direnv"
brew "logcli"

# ---- aws ----
brew "awscli"
tap "cybozu/assam"
brew "cybozu/assam/assam"
tap "aws/tap"
brew "aws-sam-cli"

# ---- ops ----
tap "hashicorp/tap"
brew "terraform-ls"
brew "tflint"
brew "sops"

# ---- api ----
cask "bloomrpc"
brew "siege"
brew "grpcurl"
brew "ghz"

# ---- k8s ----
brew "kubectl"
brew "helm"
brew "kubescape"

# ---- DB ----
brew "postgresql" # PostgreSQL
brew "mysql" # MySQL
brew "redis" # Redis
