# --------------------
# brew tap
# --------------------

# --------------------
# brew install
# --------------------

# ---- core ----
brew "git"
brew "fish"

# ---- terminal ----
brew "tmux"
tap "homebrew/cask-fonts"
cask "font-hack"
cask "font-hack-nerd-font"

# ---- Neovim ----
brew "neovim"
brew "luajit"

# ---- utility ----
brew "wget"
brew "grep"
brew "ripgrep"
brew "peco"
brew "lazygit"
brew "autojump"
brew "thefuck"
brew "fzf"
brew "jq"
brew "yq"
brew "git-lfs"
brew "watch"
brew "colordiff"
brew "gh"
brew "bat"
brew "diff-so-fancy"
brew "diffutils"
brew "age"
# brew "openssl@3"
brew "shellcheck"
brew "coreutils"
brew "moreutils"
brew "gomplate"
brew "task"
brew "telnet"
brew "tree"
brew "gnupg"
cask "git-credential-manager"

# --- dev ----
brew "ruby-build" # for rbenv
brew "node-build" # for nodenv
brew "anyenv"
brew "direnv"
brew "logcli"

# ---- aws ----
brew "awscli"
tap "aws/tap"
brew "aws-sam-cli"

# ---- azure ----
brew "azure-cli"

# ---- ops ----
tap "hashicorp/tap"
brew "terraform-ls"
brew "tflint"
brew "sops"
brew "hcl2json" # sops script

# ---- api ----
brew "siege"
brew "grpc"
brew "protobuf"
brew "grpcurl"
brew "grpcui"
brew "ghz"
brew "vegeta"

# ---- k8s ----
brew "kubernetes-cli"
brew "helm"

# ---- DB ----
brew "postgresql" # PostgreSQL
brew "mysql" # MySQL
brew "redis" # Redis

# ---- grafana ----
tap "grafana/grafana"
brew "grafana/grafana/cortextool"
brew "mimirtool"
