# --------------------
# brew tap
# --------------------

# --------------------
# brew install
# --------------------

# ---- core ----
brew "git"
brew "fish"

# ---- terminal ----
brew "tmux"
tap "homebrew/cask-fonts"
cask "font-hack"

# ---- Neovim ----
brew "neovim"
brew "luajit"

# ---- utility ----
brew "wget"
brew "peco"
brew "lazygit"
brew "autojump"
brew "thefuck"
brew "fzf"
brew "rg"
brew "jq"
brew "git-lfs"

# --- dev ----
brew "ruby-build" # for rbenv
brew "node-build" # for nodenv
brew "anyenv"
brew "direnv"

# ---- aws ----
brew "awscli"

# ---- ops ----
brew "git-crypt"
tap "hashicorp/tap"
brew "terraform-ls"
brew "tflint"

# ---- Golang ----
brew "golangci-lint"

# ---- api ----
cask "bloomrpc"
brew "siege"

# ---- DB ----
brew "postgresql" # PostgreSQL
